{
  "architectures": [
    "PanguEmbeddedForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_openpangu_dense.PanguEmbeddedConfig",
    "AutoModel": "modeling_openpangu_dense.PanguEmbeddedModel",
    "AutoModelForCausalLM": "modeling_openpangu_dense.PanguEmbeddedForCausalLM"
  },
  "bias": true,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "pad_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 12800,
  "max_position_embeddings": 32768,
  "model_type": "PanguEmbedded",
  "num_attention_heads": 32,
  "num_hidden_layers": 34,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-06,
  "rope_theta": 16000000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.2",
  "use_cache": true,
  "vocab_size": 153376
}
